JEB12345/dwm1000_dspic/dwm_spi.c
/* 
 * File:   dwm_spi.c
 * Author: jonathan
 *
 * Created on June 9, 2015, 11:17 AM
 */

#include "dwm_spi.h"
#include "decadriver/deca_device_api.h"
#include <stdlib.h>
#include <spi.h>
#include <string.h>
#include <xc.h>

dwm_1000_status dwm_status;
uint16_t wait_count = 0;
uint16_t stall_count = 0;
anchor_states anchor_state = anchor_init;
tag_states tag_state = tag_init;

/**
     * Code Copied directly or modified
     * from polypoint github code
     * https://github.com/lab11/polypoint
     */
    dwt_config_t global_ranging_config;
    dwt_txconfig_t global_tx_config;

    const uint8_t xtaltrim[11] = {
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8
    };

    const uint8_t pgDelay[8] = {
        0x0,
        0xc9,
        0xc2,
        0xc5,
        0x95,
        0xc0,
        0x0,
        0x93
    };

    const uint8_t txPower[8] = {
        0x0,
        0x67,
        0x67,
        0x8b,
        0x9a,
        0x85,
        0x0,
        0xd1
    };

    const double txDelayCal[11*3] = {
    //    -0.13, 0.36, -0.05,//T2
    //    -0.14, 0.37, -0.03,//A1
    //    -0.20, 0.39, -0.06,//A2
    //    -0.07, 0.43, 0.04,//A3
    //    -0.15, 0.38, -0.01,//A4
    //    -0.03, 0.49, 0.07,//A5
    //    -0.18, 0.45, -0.07,//A6
    //    -0.08, 0.42, -0.00,//A7
    //    0.04, 0.51, 0.07,//A8
    //    -0.15, 0.38, -0.01,//A9
    //    -0.12, 0.44, 0.01,//A10
    0.0, 0.0, 0.0, //dummy for now (EUI = 0)
       155.5433333333333,   155.0400000000000,   155.4433333333333,
       155.5766666666667,   154.9922222222222,   155.4500000000000,
       155.4855555555555,   154.9122222222222,   155.3466666666667,
       155.5000000000000,   154.9377777777778,   155.3444444444445,
       155.3955555555556,   154.8555555555555,   155.2922222222222,
       155.4966666666667,   154.9100000000000,   155.3755555555556,
       155.4133333333333,   154.9233333333333,   155.3422222222222,
       155.3266666666667,   154.8377777777778,   155.2800000000000,
       155.5188888888889,   154.9277777777778,   155.3722222222222,
       155.4877777777778,   154.9033333333333,   155.3533333333333
    };

    uint32_t global_seq_count = 0;
    uint16_t global_tx_antenna_delay = 0;

    uint32_t global_pkt_delay_upper32 = 0;

    uint64_t global_tag_poll_tx_time = 0;
    uint64_t global_tag_anchor_resp_rx_time = 0;

    uint64_t global_tRP = 0;
    uint32_t global_tSR = 0;
    uint64_t global_tRF = 0;
    uint8_t global_recv_pkt[512];

    uint32_t global_subseq_num = 0x0;
    uint8_t global_chan = 1;
    float global_distances[NUM_ANCHORS*NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS];

    struct ieee154_msg  {
        uint8_t frameCtrl[2];                             //  frame control bytes 00-01
        uint8_t seqNum;                                   //  sequence_number 02
        uint8_t panID[2];                                 //  PAN ID 03-04
        uint8_t destAddr[8];
        uint8_t sourceAddr[8];
        uint8_t messageType; //   (application data and any user payload)
        uint8_t anchorID;
        uint8_t fcs[2] ;                                  //  we allow space for the CRC as it is logically part of the message. However ScenSor TX calculates and adds these bytes.
    } __attribute__ ((__packed__));

    struct ieee154_final_msg  {
        uint8_t frameCtrl[2];                             //  frame control bytes 00-01
        uint8_t seqNum;                                   //  sequence_number 02
        uint8_t panID[2];                                 //  PAN ID 03-04
        uint8_t destAddr[8];
        uint8_t sourceAddr[8];
        uint8_t messageType; //   (application data and any user payload)
        uint8_t anchorID;
        float distanceHist[NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS];
        uint8_t fcs[2] ;                                  //  we allow space for the CRC as it is logically part of the message. However ScenSor TX calculates and adds these bytes.
    } __attribute__ ((__packed__));

    struct ieee154_bcast_msg  {
        uint8_t frameCtrl[2];                             //  frame control bytes 00-01
        uint8_t seqNum;                                   //  sequence_number 02
        uint8_t panID[2];                                 //  PAN ID 03-04
        uint8_t destAddr[2];
        uint8_t sourceAddr[8];
        uint8_t messageType; //   (application data and any user payload)
        uint8_t subSeqNum;
        uint32_t tSP;
        uint32_t tSF;
        uint64_t tRR[NUM_ANCHORS]; // time differences
        uint8_t fcs[2] ;                                  //  we allow space for the CRC as it is logically part of the message. However ScenSor TX calculates and adds these bytes.
    } __attribute__ ((__packed__));

    struct ieee154_msg msg;
    struct ieee154_final_msg fin_msg;
    struct ieee154_bcast_msg bcast_msg;
    /*****https://github.com/lab11/polypoint******/

#define BLINK_SLEEP_DELAY					1000 //ms
#define POLL_SLEEP_DELAY					500 //ms
#define FIXED_REPLY_DELAY       			150
#define FIXED_LONG_BLINK_RESPONSE_DELAY       (5*FIXED_REPLY_DELAY) //NOTE: this should be a multiple of FIXED_LONG_REPLY_DELAY see DELAY_MULTIPLE below

uint8_t dwm_init()
{
    uint8_t result = 1;
    uint32_t devID ;
    
    devID = dwt_readdevid();

    if (DWT_DEVICE_ID != devID) {
        return -1;
    }

    result = dwt_initialise(DWT_LOADUCODE    |
                         DWT_LOADLDO      |
                         DWT_LOADTXCONFIG |
                         DWT_LOADXTALTRIM);
    if (0 > result) return(-1);

    // Setup interrupts
    // Note: using auto rx re-enable so don't need to trigger on error frames
    dwt_setinterrupt(//DWT_INT_TFRS |
                     DWT_INT_RFCG |
                     DWT_INT_SFDT |
                     DWT_INT_RFTO |
                     DWT_INT_RPHE |
                     DWT_INT_RFCE |
                     DWT_INT_RFSL |
                     DWT_INT_RXPTO | DWT_INT_ARFE |  DWT_INT_LDED | DWT_INT_RXOVRR |
                     DWT_INT_SFDT, 1);

