JEB12345/dwm1000_dspic/dwm_spi.c
    }
    /*****https://github.com/lab11/polypoint******/

//#if (DR_DISCOVERY == 0)
//    addressconfigure() ;                            // set up initial payload configuration
//#endif
//    instancesettagsleepdelay(POLL_SLEEP_DELAY, BLINK_SLEEP_DELAY); //set the Tag sleep time
//
//    // NOTE: this is the delay between receiving the blink and sending the ranging init message
//    // The anchor ranging init response delay has to match the delay the tag expects
//    // the tag will then use the ranging response delay as specified in the ranging init message
//    // use this to set the long blink response delay (e.g. when ranging with a PC anchor that wants to use the long response times != 150ms)
//    instancesetblinkreplydelay(FIXED_REPLY_DELAY);
////    instancesetblinkreplydelay(FIXED_LONG_BLINK_RESPONSE_DELAY);
//
//    //set the default response delays
//    instancesetreplydelay(FIXED_REPLY_DELAY, 0);

    dwt_setleds(1);

    return result;
}

// Triggered after a TX
void app_dw1000_txcallback (const dwt_callback_data_t *txd) {
    //NOTE: No need for tx timestamping after-the-fact (everything's done beforehand)
}

// Triggered when we receive a packet
void app_dw1000_rxcallback (const dwt_callback_data_t *rxd) {
    int err;

    if (DW1000_ROLE_TYPE == TAG) {

        // The tag receives one packet: "ANCHOR RESPONSE"
        // Make sure the packet is valid and matches an anchor response.
        // Need to timestamp it and schedule a response.

        if (rxd->event == DWT_SIG_RX_OKAY) {
            struct ieee154_msg* msg_ptr;
            uint8_t packet_type_byte;

            // Get the timestamp first
            uint8_t txTimeStamp[5] = {0, 0, 0, 0, 0};
            dwt_readrxtimestamp(txTimeStamp);
            global_tag_anchor_resp_rx_time = (uint64_t) txTimeStamp[0] +
                                             (((uint64_t) txTimeStamp[1]) << 8) +
                                             (((uint64_t) txTimeStamp[2]) << 16) +
                                             (((uint64_t) txTimeStamp[3]) << 24) +
                                             (((uint64_t) txTimeStamp[4]) << 32);

            // Get the packet
            dwt_readrxdata(global_recv_pkt, rxd->datalength, 0);
            msg_ptr = (struct ieee154_msg*) global_recv_pkt;
            packet_type_byte = global_recv_pkt[21];

            // Packet type byte is at a know location
            if (packet_type_byte == MSG_TYPE_ANC_RESP) {
                // Great, got an anchor response.
                // Now send a final message with the timings we know in it

                // First, set the time we want the packet to go out at.
                // This is based on our precalculated delay plus when we got
                // the anchor response packet. Note that we only add the upper
                // 32 bits together and use that time because this chip is
                // weird.
                uint8_t anchor_id = msg_ptr->anchorID;
                if(anchor_id >= NUM_ANCHORS) anchor_id = NUM_ANCHORS;

                // Need to actually fill out the packet
                bcast_msg.tRR[anchor_id-1] = global_tag_anchor_resp_rx_time;

                //TODO: Hack.... But not sure of any other way to get this to time out correctly...
//                dwt_setrxtimeout(NODE_DELAY_US*(NUM_ANCHORS-anchor_id)+ANC_RESP_DELAY+1000);
                dwt_setrxtimeout(2000);
                tag_state = tag_final;
            } else if(packet_type_byte == MSG_TYPE_ANC_FINAL){
                struct ieee154_final_msg* final_msg_ptr;
                final_msg_ptr = (struct ieee154_final_msg*) global_recv_pkt;
                int offset_idx = (final_msg_ptr->anchorID-1)*NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS;
                memcpy(&global_distances[offset_idx],final_msg_ptr->distanceHist,sizeof(fin_msg.distanceHist));
            }
        } else if (rxd->event == DWT_SIG_RX_TIMEOUT) {
//            uint32_t delay_time = dwt_readsystimestamphi32() + global_pkt_delay_upper32;
//            delay_time &= 0xFFFFFFFE;
//            dwt_setdelayedtrxtime(delay_time);
//            // Set the packet length
//            uint16_t tx_frame_length = sizeof(bcast_msg);
//            // Put at beginning of TX fifo
//            dwt_writetxfctrl(tx_frame_length, 0);
//
//            bcast_msg.seqNum++;
//            bcast_msg.messageType = MSG_TYPE_TAG_FINAL;
//            bcast_msg.tSF = delay_time;
//            dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);
//            err = dwt_starttx(DWT_START_TX_DELAYED);
//            dwt_settxantennadelay(global_tx_antenna_delay);
//            #ifdef DW_DEBUG
//                if (err) {
//                    printf("Error sending final message\r\n");
//                }
//            #endif
        }

    } else if (DW1000_ROLE_TYPE == ANCHOR) {

        // The anchor should receive two packets: a POLL from a tag and
        // a FINAL from a tag.

        if (rxd->event == DWT_SIG_RX_OKAY) {
            uint8_t packet_type_byte;
            uint64_t timestamp;
            uint8_t subseq_num;


            // Get the timestamp first
            uint8_t txTimeStamp[5] = {0, 0, 0, 0, 0};
            dwt_readrxtimestamp(txTimeStamp);
            timestamp = (uint64_t) txTimeStamp[0] +
                        (((uint64_t) txTimeStamp[1]) << 8) +
                        (((uint64_t) txTimeStamp[2]) << 16) +
                        (((uint64_t) txTimeStamp[3]) << 24) +
                        (((uint64_t) txTimeStamp[4]) << 32);

            // Get the packet
            dwt_readrxdata(&packet_type_byte, 1, 15);


            if (packet_type_byte == MSG_TYPE_TAG_POLL) {
                // Got POLL
                global_tRP = timestamp;

                // Send response

                // Calculate the delay
                uint32_t delay_time =
                    ((uint32_t) (global_tRP >> 8)) +
                    global_pkt_delay_upper32*ANCHOR_EUI + (convertmicrosectodevicetimeu32(ANC_RESP_DELAY) >> 8);
                delay_time &= 0xFFFFFFFE;
                global_tSR = delay_time;
                dwt_setdelayedtrxtime(delay_time);

                // Set the packet length
                // FCS + SEQ + PANID:  5
                // ADDR:              16
                // PKT:                1
                // ANCHOR_ID:          1
                // CRC:                2
                // total              25
                uint16_t tx_frame_length = 25;
                // Put at beginning of TX fifo
                dwt_writetxfctrl(tx_frame_length, 0);

                dwt_writetxdata(tx_frame_length, (uint8_t*) &msg, 0);

