JEB12345/dwm1000_dspic/dwm_spi.c
                // Start delayed TX
                // Hopefully we will receive the FINAL message after this...
                dwt_setrxaftertxdelay(2000);
                err = dwt_starttx(DWT_START_TX_IMMEDIATE | DWT_RESPONSE_EXPECTED);
                dwt_settxantennadelay(global_tx_antenna_delay);
                #ifdef DW_DEBUG
                    if (err) {
                        printf("Could not send anchor response\r\n");
                    }
                #endif

                // Start timer which will sequentially tune through all the channels
                dwt_readrxdata(&subseq_num, 1, 16);
                if(subseq_num == 0){
                    global_subseq_num = 0;
//                    rtimer_set(&periodic_timer, RTIMER_NOW() + SUBSEQUENCE_PERIOD - RTIMER_SECOND*0.011805, 1,  //magic number from saleae to approximately line up config times
//                                (rtimer_callback_t)periodic_task, NULL);
                    global_seq_count++;
                    //Reset all the distance measurements
                    memset(fin_msg.distanceHist, 0, sizeof(fin_msg.distanceHist));

                }
                anchor_state = anchor_wait_final;
            } else if (packet_type_byte == MSG_TYPE_TAG_FINAL) {
                // Got FINAL

                // Read the whole packet
                dwt_readrxdata((uint8_t*)&bcast_msg, sizeof(bcast_msg), 0);

                global_tRF = timestamp;

                //TODO: might need to normalize all times to tSP and tRP
                double tRF = (double)global_tRF;
                double tSR = (double)(((uint64_t)global_tSR) << 8);
                double tRR = (double)bcast_msg.tRR[ANCHOR_EUI-1];
                double tSP = (double)(((uint64_t)bcast_msg.tSP) << 8);
                double tSF = (double)(((uint64_t)bcast_msg.tSF) << 8);
                double tRP = (double)global_tRP;

                #ifdef DW_DEBUG
                    printf("tRF = %llu\r\n", (uint64_t)tRF);
                    printf("tSR = %llu\r\n", (uint64_t)tSR);
                    printf("tRR = %llu\r\n", (uint64_t)tRR);
                    printf("tSP = %llu\r\n", (uint64_t)tSP);
                    printf("tSF = %llu\r\n", (uint64_t)tSF);
                    printf("tRP = %llu\r\n", (uint64_t)tRP);
                #endif

                if(tRF != 0.0 && tSR != 0.0 && tRR != 0.0 && tSP != 0.0 && tSF != 0.0 && tRP != 0.0){
                    double aot = (tRF-tRP)/(tSF-tSP);
                    double tTOF = (tRF-tSR)-(tSF-tRR)*aot;
                    double dist = (tTOF*DWT_TIME_UNITS)/2;

                    ////tTOF^2 + (-tRF + tSR - tRR + tSP)*tTOF + (tRR*tRF - tSP*tRF - tSR*tRR + tSP*tSR - (tSF-tRR)*(tSR-tRP)) = 0
                    //double a = 1.0;
                    //double b = -tRF + tSR - tRR + tSP;
                    //double c = tRR*tRF - tSP*tRF - tSR*tRR + tSP*tSR - (tSF-tRR)*(tSR-tRP);

                    ////Perform quadratic equation
                    //double tTOF = (-b-sqrt(pow(b,2)-4*a*c))/(2*a);
                    //double dist = (tTOF * (double) DWT_TIME_UNITS) * 0.5;
                    dist *= SPEED_OF_LIGHT;
                    //double range_bias = 0.0;//dwt_getrangebias(global_chan, (float) dist, DWT_PRF_64M);
#ifndef DW_CAL_TRX_DELAY
                    dist += ANCHOR_CAL_LEN;
                    dist -= txDelayCal[ANCHOR_EUI*NUM_CHANNELS + 1];
#endif
                    #ifdef DW_DEBUG
                        printf("dist*100 = %d\r\n", (int)(dist*100));
                        //printf("range_bias*100 = %d\r\n", (int)(range_bias*100));
                    #endif
                    //dist -= dwt_getrangebias(2, (float) dist, DWT_PRF_64M);
                    fin_msg.distanceHist[global_subseq_num] = (float)dist;
                }

                //{
                //    // calculate the actual distance

                //    double distance;
                //    double tof;
                //    int32_t tofi;

                //    // Check for negative results and accept them making
                //    // them proper negative integers. Not sure why...
                //    tofi = (int32) time_of_flight;
                //    if (tofi < 0) {
                //        tofi *= -1; // make it positive
                //    }

                //    printf("tofi: %10i\r\n", (int)tofi);

                //    // Convert to seconds and divide by four because
                //    // there were four packets.
                //    tof = ((double) tofi * (double) DWT_TIME_UNITS) * 0.25;
                //    distance = tof * SPEED_OF_LIGHT;

                //    // Correct for range bias
                //    distance =
                //        distance - dwt_getrangebias(2, (float) distance, DWT_PRF_64M);

                //    fin_msg.distanceHist[global_subseq_num] = (float)distance;

                //    // printf("GOT RANGE: %f\r\n", distance);
                //}

                // Get ready to receive next POLL
                anchor_state = anchor_wait_receive;
                dwt_rxenable(0);
            }
        }
    }
}

void send_poll(){
    //Reset all the tRRs at the beginning of each poll event
	memset(bcast_msg.tRR, 0, sizeof(bcast_msg.tRR));

	// Through tSP (tSF is field after) then +2 for FCS
	uint16_t tx_frame_length = offsetof(struct ieee154_bcast_msg, tSF) + 2;
	memset(bcast_msg.destAddr, 0xFF, 2);

	bcast_msg.seqNum++;
	bcast_msg.subSeqNum = global_subseq_num;

	// First byte identifies this as a POLL
	bcast_msg.messageType = MSG_TYPE_TAG_POLL;

	// Tell the DW1000 about the packet
	dwt_writetxfctrl(tx_frame_length, 0);

	// We'll get multiple responses, so let them all come in
	//dwt_setrxtimeout(APP_US_TO_DEVICETIMEU32(NODE_DELAY_US*(NUM_ANCHORS+1)));

	// Delay RX?
	dwt_setrxaftertxdelay(1); // us

	uint32_t temp = dwt_readsystimestamphi32();
	//uint32_t delay_time = temp + GLOBAL_PKT_DELAY_UPPER32;
	//(APP_US_TO_DEVICETIMEU32(NODE_DELAY_US) & DELAY_MASK) >> 8
	uint32_t delay_time = temp + (convertmicrosectodevicetimeu32(TAG_SEND_POLL_DELAY_US) >> 8);
	//uint32_t delay_time = dwt_readsystimestamphi32() + GLOBAL_PKT_DELAY_UPPER32;
	delay_time &= 0xFFFFFFFE; //Make sure last bit is zero
	dwt_setdelayedtrxtime(delay_time);
	bcast_msg.tSP = delay_time;

