JEB12345/dwm1000_dspic/dwm_spi.c
	// Write the data
	dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);

	// Start the transmission
	dwt_starttx(DWT_START_TX_IMMEDIATE | DWT_RESPONSE_EXPECTED);

	// MP bug - TX antenna delay needs reprogramming as it is
	// not preserved
	dwt_settxantennadelay(TX_ANTENNA_DELAY);
}

void instance_process(){

#ifdef IS_TAG
    switch(tag_state){
        case tag_init:
            tag_state = tag_poll;
            break;

        case tag_poll:
            dwt_forcetrxoff();  // Force the tx or rx state off
            send_poll();
            tag_state = tag_wait_response;
            break;

        case tag_wait_response:
            wait_count++;
            if(wait_count > 1000){
                tag_state = tag_poll;
                wait_count = 0;
            }
            break;

        case tag_final:
            wait_count = 0;
            //Make sure we're out of rx mode before attempting to transmit
            dwt_forcetrxoff();

            uint32_t temp = dwt_readsystimestamphi32();
            //uint32_t delay_time = temp + GLOBAL_PKT_DELAY_UPPER32;
            uint32_t delay_time = temp + (convertmicrosectodevicetimeu32(TAG_SEND_FINAL_DELAY_US) >> 8);
            //uint32_t delay_time = dwt_readsystimestamphi32() + GLOBAL_PKT_DELAY_UPPER32;
            delay_time &= 0xFFFFFFFE;
            dwt_setdelayedtrxtime(delay_time);

            uint16_t tx_frame_length = sizeof(bcast_msg);
            dwt_writetxfctrl(tx_frame_length, 0);

            bcast_msg.seqNum++;
            bcast_msg.messageType = MSG_TYPE_TAG_FINAL;
            bcast_msg.tSF = delay_time;

            dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);
            int err = dwt_starttx(DWT_START_TX_IMMEDIATE);
            dwt_settxantennadelay(TX_ANTENNA_DELAY);

            tag_state = tag_stall;
            break;

        case tag_stall:
            stall_count++;
            if(stall_count > 100){
                tag_state = tag_poll;
                stall_count = 0;
            }
            break;
    }
#endif
#ifdef IS_ANCHOR
    switch(anchor_state){
        case anchor_init:
            anchor_state = anchor_wait_receive;
            break;

        case anchor_wait_receive:
            // Waiting for poll message
            break;

        case anchor_wait_final:
            // Waiting for final message
            break;
    }
#endif
//    incr_subsequence_counter();
//    if(DW1000_ROLE_TYPE == TAG){
//        if(global_subseq_num < NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS){
//            //Make sure we're out of rx mode before attempting to transmit
//            dwt_forcetrxoff();
//
//            send_poll();
//        } else if(global_subseq_num == NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS){
//            dwt_rxenable(0);
//            dwt_setrxtimeout(0); // disable timeout
//        }
//    } else {
//        //If it's after the last ranging operation, queue outgoing range estimates
//        if(global_subseq_num == NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS){
//            //We're likely in RX mode, so we need to exit before transmission
//            dwt_forcetrxoff();
//
//            //Schedule this transmission for our scheduled time slot
//            uint32_t delay_time = dwt_readsystimestamphi32() + global_pkt_delay_upper32*(NUM_ANCHORS-ANCHOR_EUI+1)*2;
//            delay_time &= 0xFFFFFFFE;
//            dwt_setdelayedtrxtime(delay_time);
//            dwt_writetxfctrl(sizeof(fin_msg), 0);
//            dwt_writetxdata(sizeof(fin_msg), (uint8_t*) &fin_msg, 0);
//            dwt_starttx(DWT_START_TX_DELAYED);
//            dwt_settxantennadelay(global_tx_antenna_delay);
//            incr_subsequence_counter();
//        }
//    }
}

void incr_subsequence_counter(){
    global_subseq_num++;
    if(global_subseq_num > NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS+1){
        global_subseq_num = 0;
    }
}

// -------------------------------------------------------------------------------------------------------------------
// convert microseconds to device time
uint32_t convertmicrosectodevicetimeu32 (double microsecu)
{
    uint32_t dt;
    long double dtime;

    dtime = (microsecu / (double) DWT_TIME_UNITS) / 1e6 ;

    dt =  (uint32_t) (dtime) ;

    return dt;
}

/**
 * This function is the low level function used by the decaWave DWM1000 API
 */
int writetospi( uint16_t headerLength,
                const uint8_t *headerBuffer,
                uint32_t bodylength,
                const uint8_t *bodyBuffer)
{
    nSELECT = 0;
    write_data_SPI(headerBuffer, headerLength);
    write_data_SPI(bodyBuffer, bodylength);
    nSELECT = 1;
    return DWT_SUCCESS;
}

/**
 * This function is the low level function used by the decaWave DWM1000 API
 */
 int readfromspi( uint16_t	headerLength,
                const uint8_t *headerBuffer,
                uint32_t readlength,
                uint8_t *readBuffer)
 {
    nSELECT = 0;
    write_data_SPI(headerBuffer, headerLength);
    read_data_SPI(readlength, readBuffer);
    nSELECT = 1;
    return DWT_SUCCESS;
 }

/**
 * Reads num_bytes of data from the device
 */
void read_data_SPI(uint16_t num_bytes, uint8_t* rec)
{
    uint16_t cur_byte;
    for(cur_byte=0;cur_byte<num_bytes;cur_byte++){
        SPI2BUF = 0x00;
        while(!SPI2STATbits.SPIRBF);
        rec[cur_byte] = (uint8_t)(SPI2BUF&0xFF);
    }
}

/**
 * Writes num_bytes of data to the device
 */
void write_data_SPI(const uint8_t* data, uint16_t num_bytes)
{
    uint16_t cur_byte;
    uint8_t blahRead;
    for(cur_byte=0;cur_byte<num_bytes;cur_byte++){
        SPI2BUF = data[cur_byte];
        while(!SPI2STATbits.SPIRBF);
        blahRead = SPI2BUF;
    }
}

/**
 * Code Copied directly or modified
 * from polypoint github code
 * https://github.com/lab11/polypoint
 */
void dw1000_populate_eui (uint8_t *eui_buf, uint8_t id) {
  eui_buf[0] = id;
  eui_buf[1] = 0x55;
  eui_buf[2] = 0x44;
  eui_buf[3] = 'N';
  eui_buf[4] = 'P';
  eui_buf[5] = 0xe5;
  eui_buf[6] = 0x98;
  eui_buf[7] = 0xc0;
}
/*****https://github.com/lab11/polypoint******/

/**
 * This interrupt function is tied to the IRQ pin from the DWM1000 module
 */
void __attribute__((__interrupt__, __auto_psv__)) _INT2Interrupt(void)
{
    // This is the interrupt handler used by the DWM1000 API library.
    dwm_status.irq_enable = 1;
    IFS1bits.INT2IF = 0;
}
